Repository: KocourKuba/IptvChannelEditor
Catalog: IPTVChannelEditor.xlf
Languages: ru

# Release UnicodeIPTVChannelEditor.exe.Dialogs.103.Text
source: Custom URL
ru: Своя ссылка

# Release UnicodeIPTVChannelEditor.exe.Dialogs.103.2.Text
source: Cancel
ru: Отмена

# Release UnicodeIPTVChannelEditor.exe.Dialogs.105.Text
source: Access Info
ru: Информация о доступе

# Release UnicodeIPTVChannelEditor.exe.Dialogs.105.STATIC_OTT_Access.Text
source: OTT Access Key
ru: Ключ доступа OTT

# Release UnicodeIPTVChannelEditor.exe.Dialogs.105.STATIC_Stream_Domain.Text
source: Stream Domain
ru: Потоковый домен

# Release UnicodeIPTVChannelEditor.exe.Dialogs.105.STATIC_Read_from_URL.Text
source: Read from URL (direct link) or File
ru: Прочитать из ссылки (прямая ссылка) или из файла

# Release UnicodeIPTVChannelEditor.exe.Dialogs.105.1101.Text
source: Embed into the current list
ru: Встроить в список каналов

# Release UnicodeIPTVChannelEditor.exe.Dialogs.105.1007.Text
source: Get
ru: Получить

# Release UnicodeIPTVChannelEditor.exe.Dialogs.106.Text
source: Exclude channels
ru: Исключить из показа

# Release UnicodeIPTVChannelEditor.exe.Dialogs.106.1031.Text
source: Regular Expression
ru: Регулярное выражение

# Release UnicodeIPTVChannelEditor.exe.Dialogs.106.1027.Text
source: Case sensitive
ru: Учитывать регистр

# Release UnicodeIPTVChannelEditor.exe.Dialogs.106.1028.Text
source: Not added
ru: Не добавленные

# Release UnicodeIPTVChannelEditor.exe.Dialogs.107.Text
source: New Category
ru: Новая категория

# Release UnicodeIPTVChannelEditor.exe.Dialogs.109.Text
source: Settings
ru: Настройки

# Release UnicodeIPTVChannelEditor.exe.Dialogs.109.STATIC_Player_m3u8.Text
source: Player m3u8 (for example Media Player Classic)
ru: Проигрыватель m3u8 файлов (например Media Player Classic)

# Release UnicodeIPTVChannelEditor.exe.Dialogs.109.1091.Text
source: Sync Channel with Playlist Entry
ru: Синхронизировать канал с записью в плейлисте

# Release UnicodeIPTVChannelEditor.exe.Dialogs.109.STATIC_Max_stream.Text
source: Max stream threads
ru: Количество потоков для проверки канала

# Release UnicodeIPTVChannelEditor.exe.Dialogs.109.STATIC_Language.Text
source: Language
ru: Язык

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.BUTTON_Stream_Info.Text
source: Stream Info
ru: Информация о потоке

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.BUTTON_Channel_Info.Text
source: Channel Info
ru: Информация о канале

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1064.Text
source: for DUNE HD Players
ru: для приставок DUNE HD

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1066.Text
source: Channels:
ru: Каналы:

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.STATIC_Channel_ID.Text
source: Channel ID
ru: № Канала

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.STATIC_EPG_Time_Shift.Text
source: EPG Time Shift
ru: Сдвиг EPG

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1025.Text
source: Adult
ru: Взрослый

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1026.Text
source: Archive
ru: Архив

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1028.Text
source: Custom Url
ru: Произвольная ссылка

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1105.Text
source: First EPG ID
ru: Основной EPG

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1106.Text
source: Second EPG ID
ru: Вторичный EPG

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.STATIC_Day.Text
source: Day
ru: День

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.STATIC_Hour.Text
source: Hour
ru: Час

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1080.Text
source: Play Stream Type
ru: Тип потока

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1073.Text
source: Playlist:
ru: Плейлист:

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.STATIC_Icons_source.Text
source: Icons source
ru: Источник иконок

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1001.Text
source: About
ru: О редакторе

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1021.Text
source: View EPG
ru: Просмотр

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1024.Text
source: Check Archive
ru: Проверить архив

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1005.Text
source: Cache Icon
ru: Сохранить иконку

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1017.Text
source: Save Channels
ru: Сохранить

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1020.Text
source: Stop
ru: Стоп

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1109.Text
source: Make plugin
ru: Создать плагин

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1023.Text
source: Update Icon
ru: Обновить иконку

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.2.Text
source: Exit
ru: Выход

# Release UnicodeIPTVChannelEditor.exe.Dialogs.110.1022.Text
source: Update changed
ru: Обновить каналы

# Release UnicodeIPTVChannelEditor.exe.Dialogs.129.Text
source: Icons List
ru: Список иконок

# Release UnicodeIPTVChannelEditor.exe.Dialogs.130.Text
source: Account Info
ru: Информация о кабинете

# Release UnicodeIPTVChannelEditor.exe.Dialogs.130.1096.Text
source: Login
ru: Логин

# Release UnicodeIPTVChannelEditor.exe.Dialogs.130.1097.Text
source: Password
ru: Пароль

# Release UnicodeIPTVChannelEditor.exe.Dialogs.130.STATIC_Status.Text
source: Status:
ru: Статус:

# Release UnicodeIPTVChannelEditor.exe.Dialogs.130.1098.Text
source: Subscription:
ru: Подписка:

# Release UnicodeIPTVChannelEditor.exe.Dialogs.130.1099.Text
source: Balance:
ru: Баланс:

# Release UnicodeIPTVChannelEditor.exe.Dialogs.130.1100.Text
source: Price:
ru: Цена:

# Release UnicodeIPTVChannelEditor.exe.Dialogs.130.1007.Text
source: Get Account Info
ru: Получить

# Release UnicodeIPTVChannelEditor.exe.Dialogs.131.1097.Text
source: Key access
ru: Ключ доступа

# Release UnicodeIPTVChannelEditor.exe.Menus.111.POPUP.32800.Text
source: Make All
ru: Создать все

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32786.Text
source: Play
ru: Играть

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32798.Text
source: Add to Favorite
ru: Добавить в Избранное

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32772.Text
source: New Channel Ins
ru: Новый канал Ins

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32793.Text
source: Update Channel F5
ru: Обновить канал F5

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32792.Text
source: Disable Channel
ru: Отключить канал

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32797.Text
source: Sort Category
ru: Сортировать категорию

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32778.Text
source: Rename F2
ru: Переименовать F2

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32790.Text
source: Delete Del
ru: Удалить Del

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32775.Text
source: Move Up Ctrl+Up
ru: Вверх Ctrl+Вверх

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32774.Text
source: Move Down Ctrl+Down
ru: Вниз Ctrl+Вниз

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32779.Text
source: Get Stream Info F4
ru: Информация о потоке F4

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32799.Text
source: Clear Stream Info
ru: Удалить информацию о потоке

# Release UnicodeIPTVChannelEditor.exe.Menus.113.POPUP.32796.Text
source: Sync with Playlist Ctrl+SPACE
ru: Найти в плейлисте Ctrl+Пробел

# Release UnicodeIPTVChannelEditor.exe.Menus.114.POPUP.32771.Text
source: Add Category
ru: Добавить категорию

# Release UnicodeIPTVChannelEditor.exe.Menus.114.POPUP.32793.Text
source: Add/Update Channel F5
ru: Добавить/Обновить канал F5

# Release UnicodeIPTVChannelEditor.exe.Menus.114.POPUP.32796.Text
source: Sync with Channel Ctrl+SPACE
ru: Найти в списке каналов Ctrl+Пробел

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_FMT_CHANNELS
source: Channels: {:d} ({:d} changed)
ru: Каналы: {:d} ({:d} изменено)

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_FMT_CHANNELS_READED
source: Channels readed: %d
ru: Каналов прочитано: %d

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_FMT_CHANNELS_TOOLTIP1
source: Name: %s ID: %s EPG1 ID: %s
ru: Название: %s №: %s EPG1 №: %s

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_FMT_CHANNELS_TOOLTIP2
source: EPG2 ID: %s
ru: EPG2 №: %s

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_FMT_PLAYLIST
source: {:s}, Channels: {:d}
ru: {:s}, Каналы: {:d}

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_FMT_PLAYLIST_FLT
source: {:s}, Channels: {:d} ({:d})
ru: {:s}, Каналы: {:d} ({:d})

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_FMT_STREAM_INFO
source: Get Stream Info: %d from %d
ru: Информация о потоке: %d из %d

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_INFO_CREATE_SUCCESS
source: Plugin created. Install it to the DUNE
ru: Плагин создан! Установите его на DUNE

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_INFO_NOT_FOUND
source: Not found!
ru: Не найден!

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_INFO_RESTART_NEED
source: Restart application to take effect
ru: Перезапустите приложения чтобы применить изменения

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_WRN_CHANNEL_EXIST
source: Channel already exist!
ru: Канал уже существует!

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_WRN_CHANNEL_ID_EXIST
source: Channel with this ID already exist! Are you sure to replace?
ru: Канал с этим номером уже существует! Заменить?

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_WRN_DELETE_CHANNEL
source: Delete channel(s). Are your sure?
ru: Удалить канал(ы). Вы уверены?

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_WRN_NON_ASCII
source: Non ASCII symbols in the icon name is not allowed!
ru: Только латинские символы допустимы в имени иконки!

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_WRN_NON_ASCII_LIST
source: Non ASCII symbols in the channel list name is not allowed!
ru: Только латинские символы допустимы в имени списка каналов!

# Release UnicodeIPTVChannelEditor.exe.Strings.10.IDS_STRING_WRN_NOT_SAVED
source: You have unsaved changes. Are you sure?
ru: Изменения не сохранены. Вы уверены?

source: Add new channels list
ru: Добавить новый список каналов

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_BUTTON_SEARCH_NEXT
source: Search next
ru: Искать далее

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_BUTTON_TEST_EPG
source: View channel EPG in browser
ru: Просмотр EPG для канала в браузере

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_COMBO_CHANNELS
source: Choose channel list to edit
ru: Выбор списка каналов для редактирования

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_COMBO_PLAYLIST
source: Choose a playlist to import
ru: Выбор плейлиста для импорта

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_COMBO_PLUGIN_TYPE
source: Select Plugin for edit
ru: Выбор плагина для редактирования

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_DONATE
source: Please donate to support the developer
ru: Поддержите разработчика

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_EDIT_EPG1_ID
source: Main EPG ID
ru: Номер основного EPG

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_EDIT_EPG2_ID
source: Secondary EPG ID
ru: Номер вторичного EPG

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_EDIT_SEARCH
source: Search in channels. Use \ prefix to find by ID
ru: Поиск в каналах. Префикс \\ для поиска по номеру

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_FMT_CHANNELS_TOOLTIP3
source: Archive: %d day(s) Adult: %s In categories: %s
ru: Архив: %d дней Взрослый: %s В категории: %s

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_FMT_PLAYLIST_TOOLTIPS
source: Name: %s ID: %s EPG ID: %s Archive: %d day(s) Adult: %s
ru: Название: %s №: %s EPG №: %s Архив: %d дней Взрослый: %s

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_NO
source: No
ru: Нет

# Release UnicodeIPTVChannelEditor.exe.Strings.11.IDS_STRING_YES
source: Yes
ru: Да

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_BUTTON_CACHE_ICON
source: Store icon to the local folder instead of downloading it from internet
ru: Сохранить иконку в плагин. Или плагин будет скачивать её из Интернета

source: Choose playlist or download it from account
ru: Задать плейлист или скачать его из кабинета

source: Save downloaded playlist to disk
ru: Сохранить скачанный плейлист на диск

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_BUTTON_PACK
source: Make a plugin to install on player
ru: Создать плагин для DUNE

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_BUTTON_PL_FILTER
source: Filter the playlist
ru: Фильтр плейлиста

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_BUTTON_SAVE
source: Save channels list
ru: Сохранить список каналов

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_BUTTON_SETTINGS
source: Editor settings
ru: Настройки редактора

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_BUTTON_UPDATE_ICON
source: Set channel icon from original playlist
ru: Установить иконку указанную в плейлисте

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_CHECK_ADULT
source: Channel contents for adults
ru: Канал для взрослых

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_CHECK_ARCHIVE
source: Channel archive is supported
ru: Канал поддерживает архив

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_CHECK_CUSTOMIZE
source: Use custom stream URL for the channel
ru: Произвольная ссылка для канала

source: Days in the past to test archive play
ru: Дней назад для проверки архива

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_EDIT_ARCHIVE_DAYS
source: How many days archive is supported
ru: Количество дней архива

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_EDIT_PL_SEARCH
source: Search in the playlist. Use \ prefix to find by ID
ru: Поиск в плейлисте. Префикс \\ для поиска по номеру

# Release UnicodeIPTVChannelEditor.exe.Strings.12.IDS_STRING_STATIC_ICON
source: Click to change the icon
ru: Нажмите для выбора иконки

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_BUTTON_CHECK_ARCHIVE
source: Try to play the archive channel
ru: Проверить архив канала

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_BUTTON_STOP
source: Stop process
ru: Остановить процесс

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_BUTTON_UPDATE_CHANGED
source: Update channels changed in the playlist
ru: Обновить все каналы отличающиеся от данных в плейлисте

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_COMBO_ICON_SOURCE
source: Source type for loaded icon. Local file or internet link
ru: Источник для выбора иконки. Файл на диске или ссылка в Интернете

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_COMBO_STREAM_TYPE
source: Stream type used to test play stream
ru: Тип потока для проверки проигрывания канала

source: Hours added to day in the past to test archive play
ru: Часов назад для проверки архива

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_EDIT_INFO_AUDIO
source: Audio stream info
ru: Информация о аудио потоке канала

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_EDIT_INFO_VIDEO
source: Video stream info
ru: Информация о видео потоке канала

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_EDIT_TIME_SHIFT
source: EPG Time shift for channel, hours
ru: Сдвиг в часах для показа EPG канала

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_ERR_FAILED_PACK
source: Failed to pack plugin
ru: Ошибка создания плагина

source: Failed to pack plugin %s
ru: Ошибка создания плагина %s

source: All plugins created succesefully
ru: Все плагины успешно созданы

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_LOAD_CHANNELS_MASK
source: Channels xml(*.xml)|*.xml||
ru: Список каналов xml(*.xml)|*.xml||

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_LOAD_ICON
source: PNG file(*.png)|*.png|All Files (*.*)|*.*||
ru: Файл PNG(*.png)|*.png|All Files (*.*)|*.*||

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_LOAD_PLAYLIST
source: Playlist m3u(*.m3u8, *.m3u)|*.m3u8;*.m3u|All Files (*.*)|*.*||
ru: Плейлист m3u(*.m3u8, *.m3u)|*.m3u8;*.m3u|All Files (*.*)|*.*||

# Release UnicodeIPTVChannelEditor.exe.Strings.13.IDS_STRING_WARN_DELETE_ITEMS
source: Delete selected items. Are your sure?
ru: Удалить выделенные элементы. Вы уверены?

# Release UnicodeIPTVChannelEditor.exe.Strings.14.IDS_STRING_LOAD_ICONS_TITLE
source: Load logotype image
ru: Загрузить иконку

# Release UnicodeIPTVChannelEditor.exe.Strings.8.IDS_ABOUTBOX
source: &About Dune IPTV Channel Editor...
ru: &О Dune IPTV Channel Editor...

# Release UnicodeIPTVChannelEditor.exe.Strings.8.IDS_LANGUAGE
source: <Language name>
ru: Русский

source: Unable to download playlist!
ru: Не могу скачать плейлист!

# Release UnicodeIPTVChannelEditor.exe.Strings.9.IDS_STRING_ERR_EMPTY_PLAYLIST
source: Empty playlist!
ru: Пустой плейлист!

# Release UnicodeIPTVChannelEditor.exe.Strings.9.IDS_STRING_ERR_SOURCE_NOT_SET
source: Playlist source not set!
ru: Источник плейлиста не задан!

# Release UnicodeIPTVChannelEditor.exe.Strings.9.IDS_STRING_ERR_THREAD_NOT_START
source: Problem with starting thread!
ru: Ошибка при запуске потока!
